#+TITLE: programming-languages学习笔记--第8部分
#+DESCRIPTION: 本节学习内容: ruby基础
#+KEYWORDS: programming, ruby
#+CATEGORIES: 编程
#+LANGUAGE: zh-CN
#+OPTIONS: ^:{}

* Procs
  blocks不是对象，只能yield。但可以将blocks转换为真实的closures。
  闭包是Proc类的实例，使用方法call调用。

  Object对象的lambda方法，接受一个block,返回一个Proc对象。
#+begin_src ruby :exports both
  inc = lambda {|x| x + 1}
  inc.call 5
#+end_src

#+RESULTS:
: 6

* Hashes和Ranges
  哈希表{}
#+begin_src ruby :exports both :results output
  h = {"SML" => 7, "Racket" => 12, "Ruby" => 42}
  puts h
  h2 = {:sml => 7, :racket => 12, :ruby => 42}
  puts h2
#+end_src

#+RESULTS:
: {"SML"=>7, "Racket"=>12, "Ruby"=>42}
: {:sml=>7, :racket=>12, :ruby=>42}

  Ranges: 1..100,
  这里也是duck typing:
#+BEGIN_SRC ruby :exports both :results output
  def foo a
    a.count { |x| x*x < 50 }
  end

  puts foo [3,5,7,9]
  puts foo (3..9)
#+END_SRC

#+RESULTS:
: 3
: 5
    
